Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
   + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
              + "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-projects",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_5F3mPHgzd",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:209479276142:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::209479276142:role/sbeacon_backend_sagemaker_jupyter_instance_role",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20241204100803980800000001",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20241204100803980800000001/projects/*",
              + "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-indexer",
              + "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-submitDataset",
            ]
        }
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be updated in-place
  ~ resource "aws_dynamodb_table" "project_users" {
        id                          = "sbeacon-dataportal-project-users"
        name                        = "sbeacon-dataportal-project-users"
        tags                        = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (13 unchanged attributes hidden)

      + global_secondary_index {
          + hash_key           = "uid"
          + name               = "uid-index"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + range_key          = "name"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "_vcfsampleid" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "individualid" -> "_vcfsampleid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "biosampleid" -> "individualid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "runid" -> "biosampleid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "aligner" -> "runid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "analysisdate" -> "aligner"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "analysisdate"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pipelinename" -> "info"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pipelineref" -> "pipelinename"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "variantcaller" -> "pipelineref"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "variantcaller"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_analyses_cache"
        name               = "sbeacon_analyses_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "_vcfsampleid" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "individualid" -> "_vcfsampleid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "biosampleid" -> "individualid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "runid" -> "biosampleid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "aligner" -> "runid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "analysisdate" -> "aligner"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "analysisdate"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pipelinename" -> "info"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pipelineref" -> "pipelinename"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "variantcaller" -> "pipelineref"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "variantcaller"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "individualid" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "biosamplestatus" -> "individualid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "collectiondate" -> "biosamplestatus"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "collectionmoment" -> "collectiondate"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "diagnosticmarkers" -> "collectionmoment"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "histologicaldiagnosis" -> "diagnosticmarkers"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "measurements" -> "histologicaldiagnosis"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "obtentionprocedure" -> "measurements"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pathologicalstage" -> "obtentionprocedure"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pathologicaltnmfinding" -> "pathologicalstage"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "phenotypicfeatures" -> "pathologicaltnmfinding"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "sampleorigindetail" -> "phenotypicfeatures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "sampleorigintype" -> "sampleorigindetail"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "sampleprocessing" -> "sampleorigintype"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "samplestorage" -> "sampleprocessing"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "tumorgrade" -> "samplestorage"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "tumorprogression" -> "tumorgrade"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "tumorprogression"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "notes" -> "info"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_biosamples_cache"
        name               = "sbeacon_biosamples_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "individualid" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "biosamplestatus" -> "individualid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "collectiondate" -> "biosamplestatus"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "collectionmoment" -> "collectiondate"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "diagnosticmarkers" -> "collectionmoment"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "histologicaldiagnosis" -> "diagnosticmarkers"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "measurements" -> "histologicaldiagnosis"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "obtentionprocedure" -> "measurements"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pathologicalstage" -> "obtentionprocedure"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pathologicaltnmfinding" -> "pathologicalstage"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "phenotypicfeatures" -> "pathologicaltnmfinding"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "sampleorigindetail" -> "phenotypicfeatures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "sampleorigintype" -> "sampleorigindetail"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "sampleprocessing" -> "sampleorigintype"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "samplestorage" -> "sampleprocessing"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "tumorgrade" -> "samplestorage"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "tumorprogression" -> "tumorgrade"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "tumorprogression"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "notes" -> "info"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "_vcflocations" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "_vcfchromosomemap" -> "_vcflocations"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "createdatetime" -> "_vcfchromosomemap"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "datauseconditions" -> "createdatetime"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "description" -> "datauseconditions"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "externalurl" -> "description"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "externalurl"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "name" -> "info"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "updatedatetime" -> "name"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "version" -> "updatedatetime"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "version"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_datasets_cache"
        name               = "sbeacon_datasets_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "_vcflocations" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "_vcfchromosomemap" -> "_vcflocations"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "createdatetime" -> "_vcfchromosomemap"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "datauseconditions" -> "createdatetime"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "description" -> "datauseconditions"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "externalurl" -> "description"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "externalurl"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "name" -> "info"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "updatedatetime" -> "name"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "version" -> "updatedatetime"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "version"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "diseases" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "ethnicity" -> "diseases"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "exposures" -> "ethnicity"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "geographicorigin" -> "exposures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "geographicorigin"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "interventionsorprocedures" -> "info"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "karyotypicsex" -> "interventionsorprocedures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "measures" -> "karyotypicsex"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pedigrees" -> "measures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "phenotypicfeatures" -> "pedigrees"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "sex" -> "phenotypicfeatures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "treatments" -> "sex"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_individuals_cache"
        name               = "sbeacon_individuals_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "diseases" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "ethnicity" -> "diseases"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "exposures" -> "ethnicity"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "geographicorigin" -> "exposures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "geographicorigin"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "interventionsorprocedures" -> "info"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "karyotypicsex" -> "interventionsorprocedures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "measures" -> "karyotypicsex"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "pedigrees" -> "measures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "phenotypicfeatures" -> "pedigrees"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "sex" -> "phenotypicfeatures"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "treatments" -> "sex"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "biosampleid" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "individualid" -> "biosampleid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "individualid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "librarylayout" -> "info"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "libraryselection" -> "librarylayout"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "librarysource" -> "libraryselection"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "librarystrategy" -> "librarysource"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "platform" -> "librarystrategy"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "platformmodel" -> "platform"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "rundate" -> "platformmodel"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "rundate"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs-cache" {
        id                 = "209479276142:sbeacon_metadata:sbeacon_runs_cache"
        name               = "sbeacon_runs_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
            # (9 unchanged attributes hidden)

          ~ columns {
              ~ name       = "biosampleid" -> "_projectname"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "individualid" -> "biosampleid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "info" -> "individualid"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "librarylayout" -> "info"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "libraryselection" -> "librarylayout"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "librarysource" -> "libraryselection"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "librarystrategy" -> "librarysource"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "platform" -> "librarystrategy"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "platformmodel" -> "platform"
                # (3 unchanged attributes hidden)
            }
          ~ columns {
              ~ name       = "rundate" -> "platformmodel"
                # (3 unchanged attributes hidden)
            }
          + columns {
              + name = "rundate"
              + type = "string"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8" -> (known after apply)
      ~ code_sha256                 = "SC18ANJ/w5TA+3NTbVe8FYCyjzLxSqbwZlvmyHzYosU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-12-06T01:03:44.753+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "SC18ANJ/w5TA+3NTbVe8FYCyjzLxSqbwZlvmyHzYosU=" -> "7M9TOckrMvrfWv9LU4Ea+YyLISaWPudOTePj9JeEu7E=" # forces replacement
      ~ source_code_size            = 12549632 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep.aws_s3_bucket.lambda-layers-bucket will be created
  + resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-layers-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1813860dc15347940c890869633026551ce489e2547e90245dfc53546eb8d24a.zip" -> "builds/e64802759240836b45f808c7c7822b22df92c2bd7bc772877926101afb9c3215.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2024-12-11T00:51:08.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e64802759240836b45f808c7c7822b22df92c2bd7bc772877926101afb9c3215.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e64802759240836b45f808c7c7822b22df92c2bd7bc772877926101afb9c3215.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1301479089" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1813860dc15347940c890869633026551ce489e2547e90245dfc53546eb8d24a.zip" -> "builds/e64802759240836b45f808c7c7822b22df92c2bd7bc772877926101afb9c3215.zip"
          ~ "timestamp" = "1733208216654604000" -> "1733901797428926000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-dataPortal-0"
        name             = "sbeacon-backend-dataPortal-0"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-juptyer-notebooks",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_5F3mPHgzd"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:209479276142:notebook-instance/*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::209479276142:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gasi-dataportal-20241204100803980800000001"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-dataportal-20241204100803980800000001/projects/*",
                        ]
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-indexer",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8f3b553fd58dc8c2297d448da37218cfeed2814e75d2e3aa15be834a2338f7cf.zip" -> "builds/13ff318989687cb56c924b60acda406f59775d6cd049079f8a238a361ab8cc6a.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2024-12-10T13:01:02.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "COGNITO_MANAGER_GROUP_NAME"           = "managers"
                # (37 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/13ff318989687cb56c924b60acda406f59775d6cd049079f8a238a361ab8cc6a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/13ff318989687cb56c924b60acda406f59775d6cd049079f8a238a361ab8cc6a.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1923588331" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8f3b553fd58dc8c2297d448da37218cfeed2814e75d2e3aa15be834a2338f7cf.zip" -> "builds/13ff318989687cb56c924b60acda406f59775d6cd049079f8a238a361ab8cc6a.zip"
          ~ "timestamp" = "1733283179883287000" -> "1733901793733991000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-getAnalyses-1"
        name             = "sbeacon-backend-getAnalyses-1"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/93aef72e169a003d9533e87881860d746280442604e1d6c10736500ca461cb26.zip" -> "builds/d371623f4ac7b440cb96841f0a3ac4efd965afd6da6cb1561572a15efaaa6590.zip"
        id                             = "sbeacon-backend-getAnalyses"
      ~ last_modified                  = "2024-12-10T04:53:54.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (49 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getAnalyses",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d371623f4ac7b440cb96841f0a3ac4efd965afd6da6cb1561572a15efaaa6590.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d371623f4ac7b440cb96841f0a3ac4efd965afd6da6cb1561572a15efaaa6590.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "228588953" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/93aef72e169a003d9533e87881860d746280442604e1d6c10736500ca461cb26.zip" -> "builds/d371623f4ac7b440cb96841f0a3ac4efd965afd6da6cb1561572a15efaaa6590.zip"
          ~ "timestamp" = "1733208215682046800" -> "1733901798420531000"
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-getBiosamples-1"
        name             = "sbeacon-backend-getBiosamples-1"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/3e1ab74245664023c6319ca689e113600d6c6e1f7169fe7ffdd1e00a7bac42e7.zip" -> "builds/35f36fc5c002c7ffa0be0c68a6add16d3d60c57107eea77164a64dbf03726ce4.zip"
        id                             = "sbeacon-backend-getBiosamples"
      ~ last_modified                  = "2024-12-10T04:53:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (49 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getBiosamples",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/35f36fc5c002c7ffa0be0c68a6add16d3d60c57107eea77164a64dbf03726ce4.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/35f36fc5c002c7ffa0be0c68a6add16d3d60c57107eea77164a64dbf03726ce4.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1278731286" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3e1ab74245664023c6319ca689e113600d6c6e1f7169fe7ffdd1e00a7bac42e7.zip" -> "builds/35f36fc5c002c7ffa0be0c68a6add16d3d60c57107eea77164a64dbf03726ce4.zip"
          ~ "timestamp" = "1733208216690379000" -> "1733901799622670000"
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (47 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1119957408" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216634527000" -> "1733901797418374000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-getDatasets-1"
        name             = "sbeacon-backend-getDatasets-1"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a6c09628c4d02568cc42b7b9f3f97c8c16debf5436c4b32081cbaf0d6790fbcb.zip" -> "builds/18d3d16f617290830adb480e6eb2d2c712aa653a805a2936316125cc483a6f4c.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2024-12-10T04:54:16.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (49 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/18d3d16f617290830adb480e6eb2d2c712aa653a805a2936316125cc483a6f4c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/18d3d16f617290830adb480e6eb2d2c712aa653a805a2936316125cc483a6f4c.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2043658619" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a6c09628c4d02568cc42b7b9f3f97c8c16debf5436c4b32081cbaf0d6790fbcb.zip" -> "builds/18d3d16f617290830adb480e6eb2d2c712aa653a805a2936316125cc483a6f4c.zip"
          ~ "timestamp" = "1733208216700196000" -> "1733901796432957800"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (47 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "345897038" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216193988000" -> "1733901796337632000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_iam_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-getFilteringTerms-0"
        name             = "sbeacon-backend-getFilteringTerms-0"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f7bf6d08d424807feb0fa4f837d26829014e85a994188b2dec1931511f6773e7.zip" -> "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ last_modified                  = "2024-12-10T04:53:32.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (47 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getFilteringTerms",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "438517442" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f7bf6d08d424807feb0fa4f837d26829014e85a994188b2dec1931511f6773e7.zip" -> "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          ~ "timestamp" = "1733208216136665200" -> "1733901796912188000"
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-getGenomicVariants-1"
        name             = "sbeacon-backend-getGenomicVariants-1"
      ~ policy           = jsonencode(
            {
       
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.